import React from 'react';
import { Helmet } from 'react-helmet-async';

export default function Terms() {
  return (
    <div className="mx-auto w-11/12 my-5 text-sm">
      <Helmet>
        <title> নীতিমালা - রক্ত ডট ইনফো </title>
      </Helmet>
      {/* রক্তগ্রহণ সংক্রান্ত নীতিমালা */}
      <div className="bg-white shadow rounded-md p-4 mb-5">
        <h2 className="text-lg font-bold text-error border-b pb-2 mb-3">
          রক্তগ্রহণ সংক্রান্ত নীতিমালা
        </h2>
        <ul className="ml-5 list-disc space-y-2">
          <li className="border-b border-gray-300 pb-2">
            রক্তদাতার সাথে কোন ধরনের অর্থনৈতিক লেনদেন করলে রক্ত.ইনফো কোনভাবেই সম্পৃক্ত নয়।
          </li>
          <li className="border-b border-gray-300 pb-2">
            রক্তদাতা কাছ থেকে রক্ত গ্রহণের প্রতিশ্রুতি নেওয়ার পর রক্ত গ্রহণ পর্যন্ত সম্পূর্ণ দায়িত্ব আপনার। 
            এক্ষেত্রে, আপনি সাপোর্ট টীমের সহায়তা নিতে পারেন। তবে, রক্তদাতা অবহেলা করলে নীতিমালা অনুযায়ী তার প্রোফাইল মুছে ফেলা হবে।
          </li>
          <li className="border-b border-gray-300 pb-2">
            যেহেতু এখানে সকলের ফোন নম্বর উন্মুক্ত থাকে এবং নিরাপত্তা জনিত কারণে শুধুমাত্র পুরুষ প্রোফাইল তৈরি করতে পারবেন। 
            তাছাড়া, প্রতিটি রক্তদাতার সাথে সাপোর্ট টীমের যোগাযোগ থাকে।
          </li>
          <li className="pb-2">মানসিক ভারসাম্য ঠিক নেই - এমন ব্যক্তি প্রোফাইল তৈরি করতে পারবে না।</li>
        </ul>
      </div>

      {/* রক্তদাতার প্রোফাইল সংক্রান্ত */}
      <div className="bg-white shadow rounded-md p-4 mb-5">
        <h2 className="text-lg font-bold text-error border-b pb-2 mb-3">
          রক্তদাতার প্রোফাইল সংক্রান্ত
        </h2>
        <ul className="ml-5 list-disc space-y-2">
          <li>রক্ত ডট ইনফো তে শুধুমাত্র পুরুষদের প্রোফাইল তৈরি করা হয়।</li>
          <li>রক্তদাতার ওজন কমপক্ষে ৫০ কেজি হতে হবে।</li>
          <li>রক্তদাতার বয়স 18 থেকে 60 এর মধ্যে হতে হবে।</li>
          <li>
            যেহেতু এখানে সকলের ফোন নম্বর উন্মুক্ত থাকে এবং নিরাপত্তা জনিত কারণে শুধুমাত্র পুরুষ প্রোফাইল তৈরি করতে পারবেন। 
            তাছাড়া, প্রতিটি রক্তদাতার সাথে সাপোর্ট টীমের যোগাযোগ থাকে।
          </li>
          <li>মানসিক ভারসাম্য ঠিক নেই - এমন ব্যক্তি প্রোফাইল তৈরি করতে পারবে না।</li>
        </ul>
      </div>

      {/* রক্তদাতার প্রোফাইল বাতিল সংক্রান্ত */}
      <div className="bg-white shadow rounded-md p-4">
        <h2 className="text-lg font-bold text-error border-b pb-2 mb-3">
          রক্তদাতার প্রোফাইল বাতিল সংক্রান্ত
        </h2>
        <ul className="ml-5 list-disc space-y-2">
          <li>অর্থের বিনিময়ে রক্তদান করলে প্রোফাইল মুছে দেওয়া হবে।</li>
          <li>
            রক্তদানে কাউকে প্রতিশ্রুতি দেওয়ার পর ইচ্ছাকৃতভাবে রক্ত না দিয়ে রক্তগ্রহীতাকে বিপদে ফেলে দিলে 
            প্রোফাইল মুছে ফেলা হবে।
          </li>
          <li>
            যেহেতু এখানে সকলের ফোন নম্বর উন্মুক্ত থাকে এবং নিরাপত্তা জনিত কারণে শুধুমাত্র পুরুষ প্রোফাইল তৈরি করতে পারবেন। 
            তাছাড়া, প্রতিটি রক্তদাতার সাথে সাপোর্ট টীমের যোগাযোগ থাকে।
          </li>
          <li>মানসিক ভারসাম্য ঠিক নেই - এমন ব্যক্তি প্রোফাইল তৈরি করতে পারবে না।</li>
        </ul>
      </div>

    </div>
  );
}
